[
{"topic": "Kirk will always be better than Picard!", "category": "TV", "pro_arguments": [{"Sex   & The Motion Picture": "Redshirtsalwaysdie. Com   has an article headlined \"One draft of The Motion Picture focused more on sex\"by Rachel Carrington   On May 7, 2021   the article says: \"Things were a little sexier in one of The Motion Picture draftsBack in 1977, While the script for The Motion Picture was coming together, Gene Roddenberry wrote a screenplay of his own that was a little racier than what ended up onscreen. The draft, Entitled “In They Image” opens with Captain Kirk and his girlfriend, Alexandria, Swimming naked. When he is contacted by Starfleet on his wrist communicator, Alexandria pulls him down under the water. That seems mild enough, But that was just the beginning. Along with two female yeomans asking a new Vulcan science officer about pon-farr, The script had Kirk and the Deltan, Ilia, In a conversation that would have raised eyebrows. When Kirk meets Ilia, He tells her he knows Deltan females are not wanton, Hairless whores, A comment which has her laughing delightedly (according to the screenplay). And she retorts “on my world, Existence is loving, Pleasuring, Sharing, Caring. ” Kirk responds by asking her if she’s ever “sexed” with a human. After Ilia is taken over by V-Ger (Ve-jur in the script) and replaced with the probe we did see onscreen, Things heat up even more. The Ilia-probe is especially interested in Captain Kirk and wants to get to know him in a more intimate manner. “Kirk, Let us make sex. In a few hours, Ve-jur will arrive. I will return to my original form. ”The Motion Picture draft was discardedIn Roddenberry’s script (as described in The Fifty-Year Mission-The First 25 Years) both Decker and Ilia survived and presumably live happily ever after. That is, If she doesn’t get too attached to Captain Kirk. There’s no telling how much time Kirk would have actually spent on the bridge in this version, As between a girlfriend, Ilia, And an alien probe, He would have been kept a little busy. While some fans might think a little bit of sex would have spiced things up in Star Trek: The Motion Picture, The director of the movie, Bob Collins, And other studio execs didn’t agree, And Roddenberry’s script was scrapped. \"", "A Born Again Star Trek Sermon & Kirk- Continued": "The article continues \"Of Mexican heritage, Ramirez was always fascinated with the astrophysical knowledge of the pre-Columbian Mayan culture and its symbols. It was as if the makers of the half-century-old science fiction television series had left behind a clue for her to find. “What is Roddenberry trying to say to me? ” she asked, Referring to the creator of the TV show. Cynthia Ramirez exhibit 'Space. . . ' 2. JpegIn her exhibit 'Space. . . , ' artist Cynthia Ramirez employed the beloved characters of the original 1960s Star Trek television show -- such as Uhura (actor Nichelle Nichols) seen here -- as exemplars of human virtue. (Photo by Doug MacCash, NOLA. Com | The Times-Picayune | The New Orleans Advocate)▲As she contemplated the connections between ancient Mexican culture, Contemporary politics and the beloved old TV series, Everything just seemed to click. So Ramirez began weaving those elements into art projects. It was a big change in tone. Before she began focusing on \"Star Trek, \" Ramirez had painted a series of sorrowful, Large-scale, Still lifes of the possessions left behind by undocumented immigrants who died in the deserts of the Southwest, Attempting to enter the United States. Some people wept as they considered the implications of those paintings, She said. The works were powerful, But relentlessly grim. Spending time considering the symbolic implications of Sulu, Chekov, Scotty, And the rest was an emotional respite. Over the past four years, Ramirez wrote her own \"Star Trek\" episode, Incorporating time-travel with cosmic criticism of the 45th president. She also delivered a Unitarian Universalist sermon based on her belief that \"Star Trek\" mythology could inspire ethical guidance in life. And for art exhibits in 2019 and 2020, She painted heroic, Baroque-style portraits of the crew, Depicting Captain Kirk in the Native American clothing he wore in one particularly compelling, Culture-crossing episode. Speaking of Captain Kirk, In 2020, Ramirez paid for an opportunity to visit one-on-one with William Shatner, The actor who played Captain Kirk. During their brief Zoom session, She found him completely charming. The experience wasn’t cheap, She said laughing, “but it was worth every penny. ”Unfortunately, As the Rolling Stones (contemporaries of \"Star Trek\") put it, Time waits for no one. A few of the actors from the original 1960s series have passed away and others are quite, Quite old. Ramirez said the Mayans believed that when we die, Our spirits rise and dissolve into the cloudy Milky Way. That’s why she depicted the Enterprise crew members as small, Pale, Fading figures. “We’re not going to have these people on this planet for long, ” she said. \"", "A Born Again Star Trek Sermon & Kirk": ". . The website Nola. Com on May 7, 2021 has an article headlined \"Artist delivers a born-again 'Star Trek' sermon, Speaks to Captain Kirk, And escapes Trump’s America\"Cynthia Ramirez exhibit 'Space. . . ' 4. JpegArtist the article says \" Cynthia Ramirez experienced an epiphany   when she noticed a Mayan deity in the background of Star Trek character Captain Kirk's quarters. (Photo by Doug MacCash, NOLA. Com | The Times-Picayune | The New Orleans Advocate)▲Cynthia Ramirez exhibit 'Space. . . ' 3. JpegIn her exhibit 'Space. . . , ' artist Cynthia Ramirez employed the beloved characters of the original 1960s Star Trek television show -- such as Sulu (actor George Takei) -- as exemplars of human virtue. BY DOUG MACCASH May 7, 2021 \"Cynthia Ramirez’s exhibit titled “Space …” at the Second Floor Gallery features portraits of the main characters from the original 1960s \"Star Trek\" television series. But Ramirez’s paintings don’t capture Captain Kirk, Spock, Uhura, Bones and the rest in their swashbuckling prime. Ramirez’s ghostly portraits depict the characters in their dotage, As they face “the final frontier, ” as she puts it. Ramirez, A Southern University art professor, Calls herself a born-again Trekkie. Like practically every kid in her generation, She religiously tuned into \"Star Trek\" reruns in the 1970s, Soaking up the stories of the space adventurers who boldly went where no man had gone before. Fast-forward to 2017. Ramirez said she was scanning Netflix for escapist entertainment as a respite to the political chaos that, In her view, Accompanied Donald Trump into the White House. Something drew her to the original Star Trek episodes. Sure, The special effects were primitive and some of the situations a touch trite, But overall, She thought, The series held up pretty well. In fact, Many of the episodes seemed a perfect fit with the current conditions in the country, As the crew of the Starship Enterprise confronted intergalactic racism, Societal strife and other challenges. \"Star Trek, \" which was set in the 23rd century, Was way ahead of its time, Ramirez concluded. The humanity embodied by the integrated crew seemed to be an antidote to the divisions among Americans. But that wasn’t the reason for her rebirth as a Star Trek disciple. Ramirez’s \"road to Damascus\" moment came when she noticed that the sparse décor in Captain Kirk’s living quarters included a Mayan statue of a deity who represented cosmology. Ramirez immediately appreciated that it was the ideal object to decorate the cabin of a galaxy-hopping Star Ship captain. But what was even more perfect was how well it fit with Ramirez’s own worldview. \"", "How Kirk got his Middle Name, & William Tiberius Rice": ". . . Redshirtsalwaysdie. Com   has an article headlined \"How Captain James T. Kirk got his middle name\"by Rachel Carrington on May 6, 2021   the article says : How Captain James T. Kirk’s middle name came to be isn’t set in stone\"If you’ve watched Star Trek: The Animated Series, You know that the 17th episode of the series entitled “Bem” provided Captain James T. Kirk’s middle name as Tiberius. But from where did such an unusual middle name originate? Turns out, Captain Kirk owes his middle name to Roman history…maybe. David Gerrold, Who wrote “Bem” as well as “More Tribbles, More Troubles” for The Animated Series as well as “The Trouble with Tribbles” for The Original Series, Was attending a Star Trek convention with D. C. Fontana when someone from the audience asked them what Kirk’s middle name was. Gerrold had just finished reading a book on Roman history and still had Tiberius in his head. So that was his immediate response. And the audience was very enthusiastic about the name. But did Captain James. T. Kirk really get his middle name from David Gerrold? Gerrold shared the middle name with Gene Roddenberry who approved it, And Tiberius was used for the first time in The Animated Series. The name became a part of live- canon when it was used in the final movie that featured the original cast, Star Trek: VI The Undiscovered Country. It was during the trial of Captain Kirk and Doctor McCoy for the death of the Klingon Chancellor Gorkon. Though Gerrold shared this behind-the-scenes tidbit about the middle name in The Fifty-Year Mission (The First 25 Years), There is some who don’t agree as the full name of the main character in Gene Roddenberry’s 1964 series The Lieutenant was William Tiberius Rice. And many believe that’s where the name came from. Either way, We would have had the same middle name, And had “Bem” been used as a third season episode of The Original Series, As it had been pitched, We would have known Captain Kirk’s middle name sooner. Regardless of how the middle name came to be, The unusual moniker perfectly suits Captain James T. Kirk. \"", "Kirk's Brother in the Kelvin Timeline- Continued": "The article continues :Where Is George In The Kelvin Timeline? 2009's Star Trek explored Kirk's childhood growing up in rural Iowa, Much like his Prime Universe counterpart. An early scene sees the young Kirk stealing his Uncle's car and calling out to a hitchhiking boy named \"Johnny\" (played by Spencer Daniels) before being chased by police. Though \"Johnny\" simply seems to be a random acquaintance of Kirk's, A deleted scene shows that he was actually intended to be Sam Kirk. The cut scene featured Sam as he runs away from the family home after an argument with their Uncle Frank. Young James begs his brother not to leave, But Sam assures him he'll be fine, Noting that James has always had good grades and followed orders. The scene ends with James dutifully washing Uncle Frank's car before rebelliously deciding to steal it. This would've led straight into the high-speed chase that was included in the film's final cut. Renaming the character \"Johnny\" was most likely a decision made in editing. After all, Sam was not present on the Kelvin during the opening scene, So it would have been a little confusing to suddenly introduce an older brother out of the blue if they had deleted the prior scene. So, While Sam Kirk was nearly included within the reboot, His status as part of the official Kelvin Timeline canon is still unclear. That being said, There is still a chance that Sam could be introduced in a future project, Perhaps in the long-rumored fourth installment of the Kelvin film series. If Star Trek has proved one thing throughout its decades-long history, It's that the franchise always finds a way to patch holes in its continuity. \"", "Kirk's Brother in the Kelvin Timeline": ". . . The website   cbr. Com has an article on April 26, 2021 headlined \"Star Trek: Wait, What Happened to Kirk's Brother in the Kelvin Timeline? \" the article says:A deleted scene from 2009's Star Trek reveals plans to include Captain Kirk's older brother in the Kelvin Timeline. BY ANTHONY AMBROSE\"The 2009 film Star Trek established an alternate, Yet parallel timeline to the Prime Star Trek chronology, Diverging at the point in time when Nero's ship exits a black hole and engages the Federation ship the U. S. S. Kelvin in battle. This battle claimed the life of James T. Kirk's father George, Setting the iconic protagonist on a slightly different path to growing up into the legendary starship Captain he was destined to become. Despite this change to the character's origins, It was established in The Original Series that Kirk had an older brother named George Samuel \"Sam\" Kirk, Who worked as a scientist. As Sam would have been born before the arrival of the Narada and its battle with the Kelvin, That would mean that he would most surely exist within the Kelvin timeline. However, There is no mention of Sam Kirk in the 2009 movie, Nor in its sequels. Though this at first appears to be an oversight, The filmmakers of the reboot had actually planned to introduce Kirk's older brother and even shot a scene featuring Sam. Let's explore who George Samuel Kirk was in the Prime Timeline and what his scrapped role in the Kelvin Timeline would've consisted of. Who Is George Samuel Kirk? George Samuel Kirk made his first and only appearance in an episode of The Original Series titled \"Operation: Annihilate! \" In the episode, Captain Kirk is desperate to reach his scientist brother, Who lives on the planet Deneva, Which is next in line in a pattern of mass insanity. After beaming down to the planet with a landing party, Kirk soon finds the dead body of his brother (played by William Shatner sporting a fake mustache) and beams up his infected sister-in-law Aurelan and nephew Peter. The crew soon discovers that the planet had been besieged by flying parasites, Which soon infect Spock and claim the life of Aurelan. Fortunately, The crew is finally able to defeat the parasites using ultraviolet light, Curing the surviving Denevans, As well as Spock and Peter. While the episode doesn't focus too heavily on Kirk's emotions related to the death of his brother, It's one of the rare times fans actually see Kirk's family onscreen. However, The choice to kill off almost all of them is a strange one, Especially given that in another episode, Kirk fondly recalled a memory of Sam and his family seeing him off on his five-year mission on the Enterprise. \"", "Will the Real Star Trek Please Beam Up? Part 3": "The article lastly says:\"But for the many of us who know these characters from earlier stories such as The Wrath of Khan, Where Spock speaks that same phrase to Kirk while sacrificing himself to save the Enterprise. Whatever the feelings between old Spock and new Kirk, My heart fills with emotion when I hear those words. As we know from Star Trek Into Darkness, Which reverses the sacrifice and leaves Kirk dead after Khan’s attack, Pine and Quinto’s characters will never say those words to each other. But Shatner and Nimoy’s characters do say them every time I re-watch Wrath of Khan. By bifurcating the timeline, Star Trek (2009) makes literal an aspect of Trek that has always been true. There can be multiple interpretations of the characters, And they are valid. Leaving aside big contradictions, Like the conflicting appearances of Klingons or Trills, Trek has always invited differing interpretations because that’s the way interpretation works. We’re all different people, And we all bring different expectations, Desires, And beliefs to a piece of fiction. No one person owns the one correct version. In an earlier life, Nimoy’s Spock taught Shatner’s Kirk another important lesson, One drawn from Vulcan philosophy. Infinite diversity in infinite combinations has become a core part of Trek fandom, An essential part for celebrating the different races, Genders, Body types, And sexualities who contribute to the franchise’s continuing mission. It’s important to remember that infinite diversity also refers to our interpretations and experiences with these characters. The TOS episodes my uncle loved are real Trek, The 90s stories I love are real Trek, And the 2009 film is real Trek because there is no one “real” Trek. As the 2009 film reminds us, There are infinite Treks in infinite combinations, And it’s the privilege of all fans to seek out strange new interpretations. \"", "Will the real Star Trek Please Beam Up? Continued": "The article continues :\"The movie’s critics complain that it isn’t real Trek because Pine and Quinto don’t play the same Kirk and Spock from TOS. But here’s the thing: the movie agrees! In fact, The movie is very much about the fact that the lives of the Enterprise crew are not quite right. Nero changed reality from the moment of Kirk’s birth and his actions reverberate throughout the galaxy. The characters we once knew come into being in an all-new environment, And thus make different choices. Unmoored by the loss of his father, Kirk indulges in his reckless impulses. The cocky romantic fans saw in an episode like   “Dagger of the Mind” has been replaced by a womanizing barfly who picks fights with visiting Starfleet cadets. Spock’s reality changes when Nero destroys Vulcan and kills his mother Amanda (Winona Ryder). Once the child of two worlds, Spock now has only Earth for a home. Wishing to honor his mother’s memory, Spock embraces his human side, Making for a more emotional half-Vulcan. In this new timeline, Captain Pike (Bruce Greenwood) avoids the accident that leaves him scarred, Chekov (Anton Yelchin) joins the bridge crew much earlier, And Uhura’s (Zoe Saldana) xenolinguistic skills earn more respect. Because they are different people living in a different reality, These characters will not have the same adventures as the versions we saw before. They won’t be overrun with Tribbles, Nor will a noble commander be their first introduction to the Romulans. For this Enterprise crew, These things never happened and they never will. But as Nero himself would put it, It happened, Don’t say it didn’t happen, I saw it happen. No matter what happens in the reboot movies, All of The Original Series and movies still exist. You can watch “The City on the Edge of Forever” on the same day that you watch Star Trek (2009), Which I did while prepping for this article. Once again, The movie makes this fact part of its plot, As illustrated in a scene that brings together the old and the new. After being marooned by Spock on an ice planet, Kirk encounters Ambassador Spock, Played again by Nimoy. “James T. Kirk, ” Spock says to Pine’s character (with, I hasten to add, More than a little emotion in his voice). When Kirk asks how this elderly man knows who he is, Spock answers, “I have been and always shall be your friend. ”To Pine’s Kirk, Spock’s answer is bewildering and devoid of sentiment. Spock has not always been his friend; he just left Kirk to die on this planet. Nor does it make sense for the many people who first met these characters in this film. The line only gains meaning for them when Spock explains that he, Even the angry and hurting version, Needs Kirk as an anchor. \"", "Will the Real Star Trek Please Beam Up?": ". . . . From Startrek. Com   an article on May 6, 2021 is headlined \"Will the Real Star Trek Please Beam Up? \" The article says: Some people thought Star Trek (2009) wasn't \"real\" Star TrekBY JOE GEORGE   \"As a child on a family trip, I sat in a hotel watching Star Trek with my cousins. One uncle grumbled to another, “I don’t like this new show. The captain never leaves the bridge! That’s not Star Trek to me. ”Which captain irritated my uncle? Jean-Luc Picard, Who left the bridge so much that he hung out with Mark Twain, And was even captured by a Cardassian warlord! Granted, TNG was only in its third season when my uncle made his remark, But the lesson to me was clear. Complaining about Trek is almost as old as Trek itself. It would have been no problem if my uncle simply said that he disliked TNG. Everyone has their preferences, Even in a franchise they love. But when he said that TNG wasn’t real Star Trek, My uncle went too far. Of course, TNG is real Star Trek. Its characters are, As Zefram Cochrane bluntly put it in First Contact, Astronauts on some kind of star trek. Nearly every series has been dismissed as “not real Trek” for some reason or another, From the station-bound stories in Deep Space Nine to the emotional rawness of Discovery. But no Trek franchise has received as much ire as the reboot films, Starting with 2009’s Star Trek. Complaints started as soon as Paramount announced that Chris Pine and Zachary Quinto would replace William Shatner and Leonard Nimoy as Kirk and Spock, And they still haven’t Although I enjoy the movie, I understand why it wouldn’t work for some. Director J. J. Abrams has little use for the diplomatic dialogues and philosophical arguments found in many Trek classics, Preferring instead lens flares and explosions. The script from Roberto Orci and Alex Kurtzman contains plenty of nods to previous adventures, Including an apple-munching Kirk defeating the Kobayashi Maru simulation. But the film’s plot, In which the elderly Ambassador Spock (Nimoy) and the Romulan Nero (Eric Bana) travel to the past after the destruction of Romulus, Is a different beast entirely. Once in the past, Nero begins radically altering the original timeline, Starting with the destruction of the U. S. S. Kelvin and its field-commissioned Captain, George Kirk (Chris Hemsworth). \"", "Shatner & Star Wars in 2021 - continued": "The article continues :\"All in all, I wouldn't put any serious stock in the recent statement William Shatner made for May the Fourth. The 90-year-old actor has been plenty busy doing spoken word albums and still offering plenty of support to the Star Trek community. Maybe he will eventually do something with Star Wars, But given all he's into, Even at this stage in his life, I wouldn't expect him to journey too far into the galaxy far, Far away. \"", "null": ""}], "con_arguments": [{"Buy Adderall Online": "Buy Adderall Online Without Prescription in USA | Adderall Overnight Delivery in US and CanadaAdderall is used to treat attention deficit hyperactivity disorder - ADHD. It works by changing the amounts of certain natural substances in the brain. Amphetamine/dextroamphetamine belongs to a class of drugs known as stimulants. It can help increase your ability to pay attention, Stay focused on an activity, And control behavior problems. Buy Adderall online from here - https://ambien10mg. Org/product-cat/buy-adderall-online/Visit Ambien Pharmacy: https://ambien10mg. Org/ adderall, Buy adderall online, Adderallxr, Adderall 10mg, Adderall 20mg, Adderall 30mg, Medicine, Usa, Adhd, Sleep disorder, Insomnia, Anxiety", "“Always” is absolute": "Let me start by saying that i prefer Picard over Kirk, Both for his acting and the way the character was portrayed. And I’ll admit I’m biased having watched the next generation first. But all of that is irrelevant to the question as I see it. “Will Kirk will always be better than Picard” first is framed in a way that Kirk is better than Picard to begin with. Second I am hesitant to believe anything can and will “always” be. There are exceptions. . . . Math being a prime example.", "This is the worst debate in the entire website": "Its just one guy spamming copy pastes he found on the internet which aren't even arguments for the debate. This dude needs to get a girlfriend or something or go outside get a job etc. Like seriously what is your purpose dude? Probably not even a real person but rather a robot programmed to spam random things it found", "I have come back": "The yes side is still being massively spammed, I need reinforcements guys. Somebody spam the no side to counter this spam, It would be what Picard wanted. Kirk is a f***ing loser and you all know that. TNG is the best series and has the best crew including Picard. F*ck the Kirk spammer", "The yes side is spammed by the same person so Picard is better": "Picard is just way more recognizable and is from the better series so he wins. End of story End of story End of story End of story End of story End of story. Picard is way more respectable and has better story in the series. Also he has better memes like the famous facepalm. The spammer on the left over there is a fake star trek fan", "null": ""}]},
{"topic": "Is LGBTQ+ wrong?", "category": "Society", "pro_arguments": [{"LGBTQ+ is Homosexuality and the Bible says it is wrong": "LGBTQ+ is homosexuality. Multiple times in the Bible we are told to flee from sexual immorality, And in the Old Testament, Extreme punishments were given for those who practiced homosexuality. The temptation itself is not a sin, The wrong part comes in when you choose to go along with the temptation. Bible verses showing homosexuality is wrong are Leviticus 18:22, Leviticus 20:13, Romans 1:26-27, 1 Corinthians 6:9-10, And 1 Timothy 1:10.", "I don't hate gays,": "Let me make this real clear: I don't hate homosexuals, Bisexuals asexuals, All the other sexuals or transgenders. I just disagree with their sense of right and wrong. And either it's the world's biggest coincidence or the USA turned into a hellhole shortly after Barack Obama or the Supreme Court or whatever legalized gay marriage. I don't blame gays for this. I blame Obama.", "Its homosexuality, Not the homosexual that is evil": "For the past few decades we have seen a ever growing trend to accept the practice of homosexuality. This however is a dangerous one. With the LGBTQ+ movement leading the charge, It wishes to re define the meaning of marriage, Family, Sex and the difference between man and womanhood. Firstly, With the subject of marriage. Within our Western culture, For centuries, Marriage has always been seen as an institution for a man and women to raise a family. To this day it is still the best way to raise children hands down. Now apart from a very few exceptions a same sex marriage can not provide that for obvious reasons. Upon the subject of sex, Gay sex can not be seen as moral as it does not allow the procreation of children. One cannot just separate procreation and pleasure as otherwise sex becomes meaningless and casual. The effects of the sexual revelation can be seen today, With the rise of STDs, Teenage pregnancy, Rise of abortions, Pornography, Sex trafficking and the list goes on. Moreover it is visible within LGBTQ+ organised Pride parades that sexual deviancy is promoted by a visible few, Which then increases the number of problems that I have already stated. However it must be understood that one should NEVER hate or hurt anyone who commits these acts of sexual disorder, As heterosexuals can be just as bad, But we should help correct each other with compassion.", "Nothing is wrong nor right": "We live in a modern society were we consider things to be correct or incorrect. However, This modern system is biased towards many things. Whereas humans have adjusted to these things in a certain manner to determine the role of an object. For example; A tooth brush. It can be used for many different things, However most consider it to be used as a utensil to clean the inner caverns of our mouths. Moving towards this topic, Sexuality is but a biased thing in our modern society. To conclude, Nothing is correct or incorrect. It is just a manner of how we as a modern society consider things.", "How do you know your gender and sex don't match?": "A person came to our school to do a presentation on the LGBTQ+. She explained that if a person doesn't feel that their gender matches the one they are assigned at birth, We can change our gender. But the thing is, How do you know that your gender and sex don't match? Is it simply that you want to be another sex, For example, You're a girl and you really want to be a boy.", "People are people, Their choices are either net good or bad.": "There isn't any grey area where a person can openly throw out morality in one area so long as they pay it off in other areas. Each decision individually is tested against the limits of morality, And if you fall outside those limits you risk being burned. People know beforehand the consequences of choosing a deviant sexual relationship (they could choose any). It doesn't have to even be homosexual. The worst part of a homosexual relationship is that you bring another person down to your level … like using (drugs) with another person. In doing anything with them you empower them and make them feel like its normal and ok. Then that sentiment sticks with them like any addiction. Hell, People with addictions even think sometimes they were born that way, Predestined to use, As if they have nowhere else to turn. Its all just a denial to help justify to themselves what they are doing. The problems are self evident:1) Over emphasis on sexual pleasures … ones that can never amount to offspring as it was meant to (you can buck Darwinism if you don't like that). 2) you deprive yourself the true balance of having a hetero relationship. 3) You open yourself up to throwing out other good guidance from sources such as the bible, Just because it doesn't reflect the way you want to be. 4) You act against the idea that people are unique in that you have determined that there is no opposite sex partner for you. (prison stats clearly demonstrate that homosexuality is situational based … or worse that if people are born this way that they are also predisposed criminals)   Predisposition for crime though might support what I said above in all the other points, Though im not saying that they have that at this point. 5) Exhibit selfishness in that they are willing to walk such a hard uphill battle against nature for their own sexual pleasure. Or the fact that they don't walk what they perceive to be an even harder line by following through with the morally right path that's been presented to them. Just all round its a very belittling practice. It doesn't buy any respect for the human race, It makes us look like animals. It demonstrates that we can't handle emotions or look past our basic instincts. Its primal and disgusting, As primal and disgusting as violence against innocents is. Everytime I see it it makes me lose faith in mankind. Worse yet seeing it propped up by a morally flawed society as if a social norm.", "LGBTQ+ is spreading the wrong message": "Young children in elementary school are now being exposed to the LGBTQ community. This is dangerous, Manipulative, And damaging to our society. Children as young as 7 are claiming that they are trans, Gay, Lesbian, Etc. This is ridiculous. These children are far too young to know what gender they like or if they are in fact the opposite gender. A 7 year old should have no attraction whatsoever to another person in terms of a relationship, Serious or sexual. However, The LGBTQ community and their message spreading is enabling our youth to learn about these topics. When these children are influenced, They listen, As they are easily manipulated. This is turning people who may not be LGBTQ into members of the community. If we want a generation of delusional and wrongly influenced youth, Then yes, LGBTQ is great. However, That is not what we want, And the LGBTQ community stands in the way of a community that is born of free choice, Influencing children at such a young age.", "But only the movement": "On their own the people in these groups aren't too bad but the movement is the problem. Most LGBTQ+ people just want to get on with their lives without worry. The LGBTQ+ movement however undermines that by trying to force society to submit to their ideology. The movement (which btw is made up mostly of non-LGBTQ+ people) attacks people for the most trivial of mistakes. Trans woman: how dare you call me sir I'm gonna have a mob beat you up and then have you arrested. Or something similar.", "I don't hate them for their sexuality, Just their actions": "I don't hate anyone for their sexuality. They could be sexually attracted to trains for all I care, Honestly. I'm a Christian and I believe Love Is Love. That being said, The LGBTQABCDEFG community has gotten out of hand, Especially within these past couple of years. They are primarily responsible for \"cancel culture\" a situation that affects even small people just scrounging for money as artists and such. They are obsessed with only pushing their agenda. . . Their morals. It sucks. I had a Christian friend who literally stopped accepting herself as an LGBT individual because of how they treated our religion.", "My rights are gendergay": "It's wrong to deny me my LGBTQ rights. Gender bigots have gender hatred, Which means that I can't express my rights. I need to express myself through sex, And I'm not going to let Trump fukcs tell me I can't. My rights are gendergay, And your rights are pathetic. People are trying to ignore my rights to genderqueer sex. They other me, And instead talk about less important issues like the environment and poverty. What use is not being hungry if LGBT folk aren't validated?  I demand my gay rights, And people are just going to have to get used to other issues like low wages and climate change until my rights to sex are validated. Because genderqueer validation is the future.", "null": ""}], "con_arguments": [{"No being LGBTQIA+ is not wrong": "Lets divide this into three parts. Those who feel same-sex attraction/love -No one can choose who they love or like, And so for their feelings the cannot be held accountable for a wrong deed. And love is love, Attraction is attraction, Its all equal, Regardless of who its towards. Those who are transgender or non-binary -Have a medical condtion called gender dysphoria that makes them feel like their body and pronouns are incorrect ones, So sometimes the adjust to feel better. This helps them be happy and fufilled - a way to cope with their conidtion, Which is never wrong as it harms none. Intersex people - A biological condition where one is born with charasterics of both sexes. A way you are born, Not something you can control, So not wrong. Asexual/Aromantic People - People who cannot feel attraction and/or romantic love towards others. A way you are born, And not wrong at all.", "I can't understand why this is 50/50": "I'm not going to say much on this argument because to be quite honest I don't have the energy to go over the things I've said to many a homophobe, But seriously, I don't see what the issue is with the LGBTQ+ community? If you don't agree with it, That's your opinion and up to you and no one else to decide, I get that and I'm not going to try and change your mind. But how does that give you the right to decide whether someone else's sexuality is 'wrong'? Oh yeah, It doesn't. I'll finish this off with a quote I saw:\"Straight marriage and gay marriage are like bras and bikini tops - both exactly the same thing, But only one is socially acceptable. \"I couldn't have put it better myself.", "Are we still talking about this": "Ok, I admit the Bible has some condemnation of gays, BUT the Bible is not the universal code. You choose to follow it, And you can't force others to, And the MORE IMPORTANT part of that scripture is that you have to be nice and treat your neighbor like you treat yourself.", "People should be allowed to be whoever or whatever they want.": "You can't control what people feel- if they are lesbian, Bisexual, Transgender, Queer or identify as another sexuality than that is what they are, No question. If someone told you that you couldn't be straight you would be outraged, So why is it different when you're telling people they can't be LGBTQ+? The Bible, In this sense, Is outdated. People are what they are and you just have to accept that.", "Is LGBTQ+ wrong?": "No. Why would LGBTQ+ be wrong? Why is it wrong to have a certain sexual alignment if you do have the same criticisms when being heterosexual? Why should a person receive punishment or negativity that they did not choose. If you were to argue that people do choose their sexuality, Then still, Why is this wrong of them? Or is it simply that people wish to abuse those they do not agree with? Do what you want, Be attracted to who you want, Just don't force me to do the same.", "It doesnt matter": "Let people do whatever they want. This is how the world works now. Being a homophobe is as bad as being racist. Not everyone believes in your f***ing religion so stop forcing them to believe what you believe in. It doesnt even affect you. If you have a problem with your kids being gay then, Don't have kids. This is how the world works now", "Let people do whatever the heck they want, It doesn't affect you.": "Let people do whatever the heck they want, If individuals want be LGBTQ+ movement is simply trying to get people to becoming accepting. Individuals deserve legal rights just as a heterosexual would. If you're going to bring the bible bs into this, Then you bring religion directly into politics. . . Doesn't it say somewhere in my constitution there is \"a separation of church and state? \".", "No it isn't.": "Love is love. You cannot tell someone who they can and can't love. People don't realize that sexuality isn't something that is controllable or chosen by the person. It has to do with an imbalance of chemicals in the brain. Just like depression or other disorders, And no I'm not saying that homosexuality is a disorder. Depression is caused by an imbalance of chemicals in your brain, Where there is a significant lack of dopamine (also known as the \"Happy Hormone\") being produced in the brain. Love and accept people for who they are!", ". F, V s, Dmnfvdsmnf, Nvsd, Nfmv, Mnsfv": ". . . . . . . . . . . ;d, Ls, D;l kmasdk naoisdn poiwnepi pqwoief niquen fpoiqn poiqnprioq pwrif pj lvj nfv ndf vn fljv dlkfj vlsjdf vknsdf vmnsd, Fmnv s, Nmfv, Mnf, Mnds f, Mvnsd f, Mnv sd, Fmn s, Mdnf, Smndf v, Msndf v, Mns df, Mns f, Mn s, Fmn, Smndf, Msndf, Mns f, Mns, Fmn s, Fmn, Smnf, Mns f, Mns", "I ate a dog, Here's why": "I didn't eat a dog. (Or did I? ) The bible said nothing about   Jesus wanting to burn alive all gays, Last time I checked he just didn't like people lying, Killing others, And not being nice to each other. I don't even believe in Jesus or any \"God\", But I do in fact know that Jesus did not say to burn all gays. . Do you really think that would pop up in his head whilst he was writing down some random thoughts on a piece of paper witch is now called the \"Bible\"? Yeah I wouldn't think so. . I'm not gay, I don't think being gay is good or bad it's just GAY (I'm on the NO side because the yes side is mostly talking about burning alive gays and stuff so yeah, And I disagree with burning alive humans)", "null": ""}]},
{"topic": "Do you agree with the Derek Chauvin   guilty verdict   announced on April 20, 2021. . . ?", "category": "Politics", "pro_arguments": [{"Mauvin murdered Floyd.": "If you punch an old person and they die because of complications of being old, You are still responsible for their death. Which is why the fentanyl argument down below is garbage. If someone tells you they can't breathe, Then the last thing you want to do is place your knee on their neck with excessive force. Mauvin responded to Floyd's pleas that he cannot breathe by telling him to quit talking. He didn't say calm down. He didn't say relax. His response was arrogant, Dismissive, And callous, Highlighting his malicious intent.", "He used excessive force, Therefore the causal factor for the victims death.": "Had the officer of only used reasonable force, George Floyd would still be alive. George floyd was in handcuffs, Laid on the concrete floor, So the kneeling on him was excessive. The officer knew better, Was trained and failed in his duty to protect all citizens even those under arrest, So the question that must be asked is why did no one else step in to protect George before his death?", "Chaha real smooth": "Dededeede turn to work Derek kills a another one, Hop one time, Derek is a mruder worst than a serial killer, 2 kills this time yeahhhh that's how justice works my chideren police are always above the law. Derek goes to work kills 3 this time   he laughs as he gets free after killing 10 more people!", "null": ""}], "con_arguments": [{"No. The decision was made under threat of riots.": "The defence provided resonable doubt that Chauvin was using a standard police restraint tactic after Floyd refused to be put in the back of the car. They also proved that Floyd had 3x the overdose level of fentanyl in his system and had no damage to his corrated arteries or trachea (which would be present if his neck was being crushed).", "No, To excessive.": "He should have been charged with assault and unlawful use of force, And maybe murder, But since Floyd was resisting arrest I cannot say for sure, Floyd probably wouldn't have died if there was no drugs n his system, Kneeling on a grown mans neck for even ten minutes probably would not kill him, As you are kneeling, If   Chauvin had truly applied real force during the kneel, Then Floyds neck would have been crushed long before he died.", "The decision was made based on fear, Not on justice.": "The trial showed significant evidence to show doubts of what the public narrative showed. The fact that Floyd was high to the bones, With his dealer in the car, And a speedball found with his saliva and ADN. Prior to the accident, He was warned by his doctor of having a \"weak heart\", That wasn't able to resist all drugs he was consuming. Even though this is more than enough to doubt his culpability, Fear was the prime motivation in the decision making. With 300 blm protestors outside the court and maxine waters literal call for violence, Clearly the motivation was based on fear and not on justice. Plus the fact they came to a decision extremely fast and this being a hugely televised spectacle (the death of Floyd with the subsequent blm \"protests\"), People had a pre existing opinion based on the media narrative (that undeniably exist considering Project Veritas CNN exposure video of one of the heads of it stating they wanna \"help blm\" while being so called \"objective journalism\").", "null": ""}]},
{"topic": "We should Institute a death penalty for homophiles and transexualists.", "category": "Politics", "pro_arguments": [{"I hate gays": "The homosexual and it’s consequences have been disastrous for humanity. The LBGT community are a bunch of degenerate hedonistic pathetic excuses for humans. What does being Gay have to offer to a person’s lifestyle? Nothing. They inisist to go against nature and giving in to their mental illness. They can’t even have children. They are f***ing useless.", "Both are hostile ideologies.": "Both transexualism and homophilia are dangerous concept invented by the cultural neo-marxists. Both are demonstrably mental illnesses that serve to weaken and degenerate our nations and peoples. Homophila spreads sexually transmitted diseases and lessens population growth. It's going to the point now where they are demanding increasingly higher privileges for themselves at the cost of the majority population. We cannot allow this cultural marxist madness any longer!", "We should do it only if they are open about it and refuse to stop": "I think that a death penalty would be prudent in the case that homophiles and transexuals who are openly promiscuous are a degeneration of the sanctity of the public and society as a whole. No we shouldn't go on a witch hunt of mentally ill folks who can't control their lust or emotions but we should oppose normalizing it by any means necessary", "It is a sin.": "Homosexuality is a sin, Just like murdering, Stealing, Lying, Cheating on your spouse, Etc. And according to the scriptures, Anybody who sins against God will not inherit His kingdom. So why are we supporting this behavior? We are doing many, Many people a disservice by supporting, No, ENCOURAGING a sinful lifestyle. Would I go as far as to say that we should institute the death penalty for them? No, But there should be organizations in place to help these people, Not encourage sin.", "Not exactly true, But close": "The culture of both is completely degenerate and has no benefit to society. They should not be killed for being that way, Just if they won’t shut up about it. It’s fine if they do it in secret, But they just get so pushy about it and how everyone has to agree with them. That’s when they cross the line.", "It is unbiblical": "Throughout the Bible, Homosexual behavior is expressly forbidden. Anyone found to have committed a homosexual act was to be put to death. Simple as that. The Bible also forbids dressing as the opposite gender. No ifs buts or loopholes. Homosexuality and transsexualism were NEVER part of God’s original plan and never will be. It is simply a product of sin and imperfection. Soon enough, God will end homosexuals and transsexuals who do not repent. In the mean time, Why not get rid of some ourselves. Not because they ARE gay or trans, But because they choose to act on it and not be normal.", "Bro like come on, They are transformers, Remember Chicago?": "I hate trans people, They probably smell from all the hormones they secrete and they all look weird, You ever walked and send a tranny and felt safe, Hell nah. We need a street cleaning service that just takes care of that crowd alone. Imagine the medicare they use from taxpayer money to pay for those surgeries. I hate jews.", "God supports straight": "God only supports straight people only we should just kill all the gays in this world because straight people have turned this world into the greatest world ever I have seen nothing but harm from gay people all around the world I think that it is about time to turn this world back into a straight only world", "They need to be dead": "I would rather live in a straight world rather than a stupid dumb gay world we live in right now we should just give a death penalty to all the gays in this world so that way we can protect this world and of course stop gays from turning this world into dangerous", "Gays are too dangerous": "Gays are evil dangerous and of course they caused great damage to the world like right now the gays have ruined this world and they should have to be punished for that we should punish all the gays with harsher punishments in order for this world to become straight only", "null": ""}], "con_arguments": [{"A death penalty can only be justified if there is an exceptional amount of harm being inflicted. Neither group mentioned meets this standard.": "The death penalty is typically reserved for the most heinous of crimes. Murderers are typically those who receive the death penalty. In this instance, The murderer has inflicted a massive amount of harm against an individual by ending their life, And against the individual's loved ones by depriving them of that individual. In other words, Only when the harm caused by an action is equivalent to taking a life should a death penalty be considered. It goes without saying that sexual practices or gender identity can never fulfill this standard. Nobody dies as a result of being too close to people who are having gay sex. Nobody dies as a result of passing by a transgender person in the street. The opposition states that these are \"dangerous ideologies\" perpetuated by \"cultural Marxists\". This is patently false, As gay sex has been observed both in nature and in societies that developed before Karl Marx's writings or any of their derivatives. The statement that gay sex \"spreads sexually transmitted diseases\" is irrelevant, As any kind of sex is capable of spreading disease without proper protection and testing. The claim that it \"lessens population growth\" is similarly useless, As population growth reduces in response to a vast number of other variables, Most notably education and standard of living. Blaming gay people for a decrease in population growth arbitrarily ignores the other, More substantive influences. The claim that either gay or transgender people are \"degenerating the nation\" is entirely without substantiation. The opposition does not care, Of course, Because the intent is only to latch onto a convenient scapegoat for the systemic failures of late-stage capitalism. The claim that sexual and gender minorities are grasping for privileges as the cost of the majority is just as unfounded as the rest. The only \"privilege\" I have ever seen agitated for is the privilege to live without the threat of violence or oppression. Clearly the opposition does not respect the right of other people to live as they see fit. It is my opinion that those the opposition threatens should respond in kind. A tolerant society can only exist if those that would threaten it with autocracy and genocide are suppressed and expunged with the same brutality they reserve for their scapegoats.", "A thousand times no": "I really don't get what is so hateable about gay people. We're not hurting anyone, We're just being our fabulous selves. The death penalty for any crime is barbaric, But being gay isn't even a crime. Y'all can leave your baseless hate elsewhere, As it has no place in a society with any common sense whatsoever.", "This will backfire on you": "Sven people like you are why Christians will be hunted down. And do not tell me you are the salt of the earth because you have no flavor. You can be irritating all by yourself without a hint of godliness. Oh boo hoo my Starbucks cup doesn't say Christmas lets make a dramatic scene. Oh my gosh I see a dude with another dude lets stone them on the spot. They are going to torture Christians and persecute them like never before. Sven you are a stumbling block. You are not going to heaven and you block other from going into heaven and you are the reason why Gods good name gets insulted by the heathen.", "Absolutely no way": "I just don't understand why anyone would think that we should institute a death penalty for homosexuals and transsexuals. The LGBT community deserves rights just like anyone else. Being gay is not 'unnatural' as it occurs in nature. It is homophobic and insulting to say that we should ever do such a thing. This kind of punishment has no place in our society. LGBT people did nothing wrong.", "Homophobia is gay": "You cannot change a gay person. Even if being gay was a choice, So what? People choose to be an asshole, And they still marry. You complain about children being sexualized from lgbt, Yet explain all those beauty pageants for cis girls. Straight people can still have HIV, And there are several straight pedophiles out there. Just leave them alone, They are not harming you in any way.", "Gays and transgenders have the right to be!": "Besides, I disagree with the death panelty plain and simple. Honestly, I can't believe homophobes and transphobes still exist in this world! I thought it was 2020! What happened to progress? When will conservative ideologies finally be illegal like they should have always been? There is no reason to fight progress.", "Only the insane, And evil, Could support this": "First of all, The Death Penalty is reserved for serious crimes only. Second, LGBT people who simply want to live their lives and not be bothered is HARDLY a serious crime. And the people on the other side saying \"Yes\", Are themselves depraved sociopaths, Devoid of morality. I'm grateful that literal human excrement like them are not running things.", "We are equal.": "First of all I don’t agree in general with the death penalty. I do not see why homosexuality or transsexualism should be a problem, Other than for religious views, Which I disagree with too, Because God says he loves people no matter what. Thus people are equal and no one deserves to be disrespected just because you do not agree with their lifestyle.", "Obviously not wtf": "Any christian supporting the death sentence on people that as you say choose it do not deserve to die. That is so contradictory. God made life and it is a gift so killing people? What on earth. Even if you argue that they are degenerates, They are not killing others and the only one getting harmed is you with your seriously flawed and backwards views. Get a life! I can't believe 40% of people here agree to killing innocent people. If it's a mental illness help them! If it's a choice or a lifestyle know that we as God's children have free will and that does NOT mean killing them. This debate is so messed up.", "N o you idiot": "You fool. You absolute buffoon. You think you can challenge me in my own realm? You think you can rebel against my authority? You dare come into my house and upturn my dining chairs and spill coffee grounds in my Keurig? You thought you were safe in your chain mail armor behind that screen of yours. I will take these laminate wood floor boards and destroy you. I didn’t want war. But i didn’t start it.", "null": ""}]},
{"topic": "Do you agree with the Black Lives Matter Movement?", "category": "Society", "pro_arguments": [{"BLM or if not you are racist.": "Isuport it because it is a fight of a huge minory with has suffered a lot and they just want to be the same as everyone as we are all humans. Also it is a fight between police with are corrupt and illegal with the only thing they do is to abuse of the power they have with everyone.", "Only the stupid could disagree": "I won't bother pointing out the obvious flaws in the \"statistics\" of the other side of the argument. Makassar already did that (seeing a coherent argument on this site was a nice change of pace). However it seems necessary to point out that every flaw pointed out was literally right in front of their face. They clearly aren't reading the articles where they found these statistics. They're not even looking at the entire chart as both the articles and the charts point out everything Makassar said. When you have to blatantly manipulate statistics to support your argument, You are wrong. The only way the other side of the argument has any leg to stand on is if there is no police bias against black people. Yet there are roughly 6 black men in prison for every white man. We're the majority out here but a minority in prison. Anyone who honestly believes that black people commit 6x more crimes than white people is an ignorant racist. Because every study ever done on the matter, Including nazi Germany, Came to the conclusion that all races are breaking the law at more or less the same rate. Speaking of nazi's, They are still a thing in Germany and even they are looking down at us for our racism. Finally if you have to continuously say \"I am not a racist\" then you absolutely are a racist and you're part of the problem. Because you're using that phrase to defend racist statements and you use it over and over and over again. Do you really think no one can see through that? People who aren't racist literally never have to say that phrase because they don' t say racist shit in the first place.", "I support the Black Lives Matter movement.": "I support the Black Lives Matter movement because daily African Americans are mistreated, Murdered, And ignored. Yearly cops are murdering black lives and they are let off free, Most get suspended, But very few get justice they deserve. The justice system is outdated and people are tired of the racial injustice. Black lives must be treated equal as one before all lives matter. Matter is the minimum, Black lives are worthy! Black lives are not disposable! Black lives are needed! Black lives are HUMAN!", "Of course Black Lives Matter": "This shouldn't be a thing people are arguing about. If you read and contextualize the statistics black people are being killed at a disproportionate rate. They make up 13 percent of the population and have been suffering from oppression for centuries. From slavery to Jim Crow laws, To redlining, And the war on drugs. We need to stand by their side and help fight the constant racism they experience. I hope people can understand that this movement is not against them, This movement is trying to fight for racial equality in America.", "If you don't you are racist or ignorant.": "It appals me to see how many people are opposed to equality on the other side. They use few statistics, And those they do use are not properly being examined, Misleading the ill-informed. People are associating a movement with the actions of a few individuals. You can see that in the last week the protests have become less violent, Coincidentally just as the police force in the USA becomes more civil as they are globally condemned for their response to the protests. Some statues have been removed, However many protestors instead want people to recognise that the historical people we hold up as champions were not perfect, And had some deep flaws based on society at the time. Just as many are requesting that especially egregious figures instead be replaced by equally as important figures who didn't hold white supremacist views. Although White individuals may be killed more often by Police than Black individuals, You would expect this when they make up around 60% of the population compared to 26%. When taking into consideration percent of the population by skin colour, Black individuals are 3 times as more likely to be killed than their White colleagues. Police are also not charged 99% of the time, Which shows just how much they get away with. At most they may have to switch county, But they are still able to remain police officers. ISIS tries to kill people while Black Lives Mater doesn't, So there is no sane comparison. The first world was trashed by the elitist white supremacy viewpoint, Unless you liked the good old days of slavery, Then yes it trashed your ability to be an abhorrent human being. Also if you ever feel like you may become a minority, And feel in danger then; you will know how every non-white person feels, And can simply go back to Europe where all the Europeans live. Also calling African-American people criminals without any evidence is racist, Making you, At least partly racist. Black Lives Matter has nothing to do with religion so it cannot be Anti-Semitic (hatred against Judaism). Black Lives Matter does not call for African-Americans to become the leaders of society, Only asking that they can have the same basic rights, Protections and ability to not fear for their lives every living second. The All Lives Matter movement calls for the status quo to remain, Which means only white lives matter.", "Black Lives Matter": "Why is this statement controversial? It simply states that the lives of Black people matter. The fact that this statement even needs to be made emphasizes it's relevance. To not be able to accept this simple phrase, To say, 'yes, The lives of Black people matter'. There is perhaps another argument to be had about the violence taking place, Whether it is relevant to the cause, Whether it helps or harms the cause. But why is the violence occurring? Watching social media, We can clearly see that police are agitating often peaceful demonstrations. The police response to a protest directed at their brutality has been to increase their violence - what options do the protesters have then but to respond with violence?", "Black lives matter.": "To everyone who's counter-argument is \"all lives matter\": All lives can't matter until black lives matter. Last time I checked, They don't yet. Black Americans are 2. 5X more likely to be a victim of police brutality. Yes, More white people get brutalized by the police every year, But people of color are considered \"minorities\" for a reason. When you adjust the statistics to accommodate that fact, You end up with the 2. 5x. No one is advocating for \"black supremacy\". They're just anti white supremacy. White privilege is real. Being privileged doesn't mean you don't have struggles. It just means the color of your skin isn't one of them. You're not oppressed.", "Obviously. Why wouldn't they.": "Sorry, But they do matter. If you can't get that through your thick skull, Then that's your problem. Watch the movie Amistad. It'll help you realize what has happened to these poor people throughout history. Racism is an evil, Ugly mark on society, And if you are against BLM, You're racist.", "Of course black lives matter": "The Black Lives Matter movement is not saying that everyone else's lives do not. It is simply saying that black people have been treated like their lives do not matter. The movement is taking a stand. Think of it as saying Black Lives Matter TOO. I'm white but I will always support the movement.", "Black Lives Do Matter.": "All of the protestings are necessary because people have looked down on Black people for thousands of years now and it is time to change. Now destroying people's stores and all of their hard work is not ok but all of the peaceful protests are getting now where Black people are still dying and are not getting justice until this stops. We are all human and we are all the same it does not matter what color your skin is. WE ARE THE SAME.", "null": ""}], "con_arguments": [{"All Normal Human Lives Matter, That includes black lives.": "It isn't just black lives who matter. There are white lives and other human lives. ALL LIVES MATTER. Got it? ALL NORMAL HUMAN LIVES MATTER. Normal boys' lives, Normal girls' lives, Normal mens' lives, Normal womens' lives. Not gross trannies, Degenerates nor sjws nor feminazis who believe in degenerative ideologies such as abortion and there being \"more than two genders\". All this bs is coming from the leftists/globalists. WAKE UP PEOPLE. KNOW THE TRUTH AND THE TRUTH SHALL SET YOU FREE. Racism doesn't go one way, It goes both ways and right now, Blacks have become more racist than whites. Not all blacks are like this but still. Whites are not to blame when a black guy or girl DOES COMMIT A CRIME. TAKE RESPONSIBILITY FOR YOUR OWN ACTIONS. EVERY MAN AND WOMAN, EVERY BOY, EVERY GIRL HAS TO, GOT IT? IT DOESN'T MATTER WHAT HIS OR HER BACKGROUND IS. DO NOT BLAME ANOTHER FOR SOMETHING YOU DID.", "The Black Lives Matter movement is a Terrorist   group, Racist & Anti-Semitic": "I have nothing against black people, I have many black friends, But the Fact is The Black Lives Matter movement is all built on Lies, Lies, Every year in America Far More White People, Far More White Men in America are killed every year by Police than Black Men. Far More White People and White Men are killed by Police in America every year than Black people and Black Men. The death of George Floyd was very tragic, but if George Floyd was White, Would anyone care? Black Lives Matter is a Hate Group, a Terrorist Organization, And is Racist, Anti-Semitic and built upon LIES,", "Things have turned violent": "Originally I was supportive of the movement however after a while I realised that many people started taking things to the next level. They are assaulting police officers, Threatening to pull down extremely historical statues even though they have little evidence (Winston Churchill in parliament square and Robert Baden-Powell the founder of scouts). They are turning into a violent angry mob who are breaking social distancing regulations which threatens a second outbreak. I am just waiting for the headlines to say that either a police officers or a protester is killed.", "They have no clear goals": "The statistics at DOJ absolutely do not agree with the BLM movement. There are a COUPLE studies done at highly liberal universities showing that cops are more likely to shoot, Pull over, Etc blacks. But most studies found no difference. If a meta analysis was performed it would likely show NO DIFFERENCE. Also, Yes, Cops do racially profile. Why? Blacks perform more crime x5. Just look on the DOJ.", "It's a front": "It is a total front by the ADL and MOSSAD and jew in general. FACT. They interfere with every grassroots protest. THIS IS NOT GRASSROOTS. This is a SCAM. FACT. The jew is the spawn of Satan. There were BRICKS placed outside of a Home Depot to make them RIOT on purpose. . .", "Black Lives Matter is truly segregative and it has failed to address equally all racism": "I voiced an opinion as an Asian. Now, Do you think that Black Lives Matter represents for anti-racism, Or just only fighting for the people of Black-skin, Like those from Sub-Saharan Africa? I sympathize with the Black people who suffered racism, But what about Black racism toward non-Black subjects? Also, The people who are of Asian and European origins who lived in Africa have been forcibly chased away because of their economic achievements. Remember Indians expelled by Idi Amin in Uganda? What about Lebanese people being forcibly removed in West Africa, Too? Likewise, You forget that Black Lives Matter has ignored the increasing racist situation against Black people in Asia, For instance, China, Japan, Korea, Vietnam and even Thailand and India, Where the hatred against black-skinned people went undetected - they just instead shouting against America for racism and yet ignoring it. We're all fuckin' human, First. Ignorant is a bliss, Son. Black people deserve equality, But they need to check their fanaticism and partiality, Too.", "BLM is racist": "Before you judge this look at what BLM is actually doing. They riot and loot businesses and this affects employees that are black. They may lose their jobs because of them. Also, If you are a black liberal, Hooray! But a black conservative? You don't matter. Also, They don't seem to care about unborn black babies. They side with Planned Parenthood even though it was created to kill off their population. BLM is racist", "No, I will never support a black supremacist movement like BLM": "Like the headline says, BLM is a black supremacist movement that is extremely racist towards whites and extremely intolerant towards anyone who disagrees with them. They are a cult and it's sad to see that this propaganda is being pushed in our public schools. Also BLM's founders admitted that they are Marxists and BLM is against the nuclear family(it says it on their website under their what we believe page). Plus the riots they cause have destroyed small business, Apartments, And caused billions in damage. So yea, I don't agree with BLM", "BLM Wants Superiority to Whites": "Stop pretending that African Americans are so oppressed here. There is no law today in America that supports discrimination. If African Americans are equal in law then they are equal. This movement seeks to make it impossible to pull over or arrest an African American because then you are deemed to be a racist and fired form your job. Go look at South Africa where the blacks have killed thousands of white farmers in racially motivated attacks in order to take their land. The government has even passed laws that allow the seizure of white property without compensation. That is racism.", "Who is killing blacks?": "In 2019 race of people killed by police nationally:White 370 (36%)Black 235 (23%)Hispanic 158Other 39Unknown 202If we look at Homicide by race we see out of 2, 491 blacks being killed, 2, 245 were killed by blacks, And only 189 by whites. So if you conclude that Black lives matter, I agree, But so does any person, Not just blacks. And if you want to make the biggest impact on saving black lives from homicide, You need to look at blacks first, Simply by numbers.", "null": ""}]}
]